app/controllers/users_controller.rb

  def create
		# # render plain: params[:article].inspect
		# p user_params
  	@user = User.new(user_params)#private method call
    p @user
  	if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_hash", "cohort_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)